// ==============================================================================
// 🛠️ HENRY'S ANNIVERSARY CONFIGURATION
// ==============================================================================

export const memories = [
  // ----------------------------------------------------------------------------
  // MEMORY 1: The First Date: The Brew
  // ----------------------------------------------------------------------------
  {
    id: 1,
    title: "Our First Date: The Brew", 
    date: "25 Dec 2024",
    location: [16.7973890, 96.1310212], 
    
    images: [
      "/photos/date-1-1.png", 
      "/photos/date-1-2.png", 
      "/photos/date-1-3.png"
    ],

    description: "ကိုကို သဲသဲကိုဖွင့်ပြောခဲ့တဲ့ The Brew ဆိုင်လေးပေါ့😙😙 ပထမဆုံး date မှာ အဆင်သင့်ဖြစ်နေအောင် ပန်းစည်းဝင်ယူပြီး စောစောရောက်အောင်သွားခဲ့တာ၊ ပြီးတော့ ပန်းစည်းကြီးဘယ်နားဖွက်ရမလဲမသိတာနဲ့ waiter ကိုပဲ သိမ်းခိုင်းလိုက်တယ်😭 သဲသဲရောက်လာတော့ သဲသဲနဲ့ သဲသဲအမေနဲ့ကို နှုတ်ဆက်ပြီး သဲသဲကိုအထဲခေါ်သွားပြီးတော့ ဖွင့်ပြောဖို့ကို ပြောမထွက်တာနဲ့ မဖြစ်မနေပြောဖြစ်သွားအောင် waiter ကို ပန်းစည်းယူလာခိုင်းလိုက်တယ်😌❤️",
  },

  // ----------------------------------------------------------------------------
  // MEMORY 2: The First Date: Golden Park Spa (First Kiss)
  // ----------------------------------------------------------------------------
  {
    id: 2,
    title: "Our First Date: Golden Park Spa",
    date: "25 Dec 2024",
    location: [16.8772458, 96.2065217], 
    
    images: [
      "/photos/date-1-4.png", 
      "/photos/date-1-5.png", 
      "/photos/date-1-6.png"
    ],

    description: "Cafe date ပြီးတော့ ကိုကိုတို့ Golden Park Spa ကို အတူ taxi ငှါးပြီးသွားခဲ့ကြတယ် ချစ်သူတွေအဖြစ်နဲ့😁❤️❤️❤️❤️ အရမ်းအသည်းယားနေခဲ့တာ၊ ကားပေါ်မှာကတည်းက ဖက်နမ်းချင်စိတ်တွေ မနည်းထိန်းထားရတယ်၊ ဟိုရောက်တော့လည်း လူတစ်သိုက်ရဲ့ တိုက်တွန်းမှုနဲ့ နမ်းဖြစ်သွားတာပါပဲ၊ အဲ့ကတည်းက တစ်ချိန်လုံးနမ်းတဲ့အကျင့်က စသွားတာ ကိုကို စင်္ကာပူလာတဲ့အထိပဲ🥺 အအေးခန်းထဲမှာ နှစ်ယောက်တည်းဖက်ပြီး ကြည်ကြည်နူးနူးရှိနေခဲ့တာလေးလည်း အရမ်းသတိရမိတယ်ဗျာ🫶🏻",
  },

  // ----------------------------------------------------------------------------
  // MEMORY 3: The Second Date: The Secretariat
  // ----------------------------------------------------------------------------
  {
    id: 3,
    title: "Our Second Date: ဝန်ကြီးများရုံး",
    date: "Jan 2025",
    location: [16.7755078, 96.1658212], 
    
    images: [
      "/photos/date-2-1.png", 
      "/photos/date-2-2.png", 
      "/photos/date-2-3.png"
    ],

    description: "ကိုကိုတို့ ဒုတိယ date လေးအတွက် မနက်ပိုင်း Cafe DiBar မှာ စားပြီးတော့ ဝန်ကြီးများရုံးကိုသွားခဲ့ကြတယ်😙😙 အဲ့ရောက်မှသိလိုက်ရတာက ထင်ထားသလောက်တော့ လည်စရာများမနေဘူးဆိုတာပဲ😭 နေကလည်းပူနေရော၊ ကိုကိုတို့ နည်းနည်းပဲ ပတ်ပြီး မုန့်စားခဲ့ကြတယ်၊ ပြီးတော့ အပြန်မှာ အမေ့ကို ဝန်ကြီးများရုံးမှာပဲရှိသေးတယ်ပြောပြီး ကန်တော်ကြီးလစ်ခဲ့ကြတာ😎❤️ (ဒါပေမယ့် ကန်တော်ကြီးမှာလည်း ဝင်တဲ့အပေါက်မှားတော့ လည်စရာသိပ်မရှိနေပြန်ဘူး၊ အဲ့တာနဲ့ ရယ်နေကြရတာနဲ့တင်ပြီးသွားတယ်🥹🥹)",
  },

  // ----------------------------------------------------------------------------
  // MEMORY 4: The Third Date: UIT
  // ----------------------------------------------------------------------------
  {
    id: 4,
    title: "Our Third Date: UIT...",
    date: "Feb 2025",
    location: [16.8561432, 96.1352782], 
    
    images: [
      "/photos/date-3-1.png", 
      "/photos/date-3-2.png", 
      "/photos/date-3-3.png"
    ],

    description: "ဒီ date လေးကတော့ ကျောင်းဖွင့်ရက်နဲ့တိုက်နေတာကြောင့် ကျောင်းမှာပဲ ကိုကိုတို့ date လိုက်ကြတယ်🥹❤️ ခေါက်ဆွဲအတူမှာစား အချိုရည်အတူမှာသောက်ပြီးတော့လေ၊ ပြီးတော့ ကိုကို သဲသဲကို online ကနေပန်းစည်းမှာပေးဖူးတာ ဒီတစ်ခေါက်ပထမဆုံးပဲ😌 ကျောင်းမှာပဲ အနမ်းတွေပေးလိုက် ဖက်ထားလိုက်နဲ့ ပြီးသွားတာပေါ့နော်🎁 ဒီ date က ပုံလေးတွေမရှိတော့ ကိုကိုတို့ ဆေးကျောင်း fw သွားလည်တုန်းကဟာလေးရယ် သဲသဲပေးတဲ့ Valentines’ Day Gift Box လေးရယ်ထည့်ထားတယ်😁",
  },

  // ----------------------------------------------------------------------------
  // MEMORY 5: The Fourth Date: From Our Homes
  // ----------------------------------------------------------------------------
  {
    id: 5,
    title: "Our Fourth Date: Home",
    date: "March 2025",
    location: [16.8561430, 96.1352782], 
    
    images: [
      "/photos/date-4-1.png", 
      "/photos/date-4-2.png", 
      "/photos/date-4-3.png"
    ],

    description: "ဒီလ ၂၅ ရက်နေ့လည်း ကျောင်းစာမေးပွဲတွေကြောင့်နဲ့ date မသွားဖြစ်ကြပြန်ဘူး😞😞😞 ဒါပေမယ့် ၂၀ ရက်နေ့မှာတော့ Zealax Hotel မှာလာတွေ့လိုက်ရသေးတာပဲလေနော်👀👀👀 ပြီးတော့ မှတ်မှတ်ရရ monthsary အပြီး ၂၈ ရက်နေ့မှာ သဲသဲရယ် ကိုကိုရယ် ကိုကို့အမေရယ် Marketplace ဝင်စားကြတာလေ😭 စားပြီးပြန်တာနဲ့ ငလျင်အကြမ်းကြီးလှုပ်တော့တာပဲဗျာ🙏🏻🙏🏻",
  },

  // ----------------------------------------------------------------------------
  // MEMORY 6: The Fifth Date: Times CITY + Snacks Corner
  // ----------------------------------------------------------------------------
  {
    id: 6,
    title: "Our Fifth Date: Times City & Snacks Corner",
    date: "April 2025",
    location: [16.8165988, 96.1287195], 
    
    images: [
      "/photos/date-5-1.png", 
      "/photos/date-5-2.png", 
      "/photos/date-5-3.png"
    ],

    description: "ဒီ date လေးအတွက် ကိုကိုတို့တွေ Times City ကို သွားပြီး board game တွေ အဓိကဆော့ခဲ့ကြတယ်😍 အရမ်းပျော်ဖို့ကောင်းခဲ့တယ်နော် မှူးလေး၊ ရောက်ကတည်းက ရယ်နေရတဲ့ ပြန်ရတဲ့အချိန်အထိ တောက်လျှောက်ပဲ၊ PS4 game တွေလည်း အတူဆော့ခဲ့ကြသေးတယိ🙂‍↕️ သဲသဲလည်း tiktoker တွေ interview တာ ခံလိုက်ရသေးတယ်၊ ပြီးတော့ Snacks Corner မှာ ခေါက်ဆွဲဝင်လုပ်ပြီးစားကြတာ စပ်လွန်းလို့ မျက်ရည်ပါကျတယ်ဗျာ😭😭 ဒါပေမယ့် အရမ်းပျော်ဖို့ကောင်းခဲ့တာပဲနော် ဒီတစ်ခေါက်က❤️",
  },

  // ----------------------------------------------------------------------------
  // MEMORY 7: The Sixth Date: JoJo Hotpot
  // ----------------------------------------------------------------------------
  {
    id: 7,
    title: "Our Sixth Date: JoJo Hotpot!",
    date: "May 2025",
    location: [16.7923661, 96.1696219], 
    
    images: [
      "/photos/date-6-1.png", 
      "/photos/date-6-2.png", 
      "/photos/date-6-3.png"
    ],

    description: "Date 6 လေးအတွက်လည်း ကိုကိုတို့ ၂၅ ရက်နေ့အစား အကြောင်းတစ်ခုခုကြောင့် စောသွားလိုက်ပုံပဲ👀👀 JoJo Hotpot သွားစားခဲ့ကြတာ မှတ်မှတ်ရရလေးပေါ့ဗျာ😙❤️❤️ သဲသဲကို ပုစွန်လေးတွေခွါလို့လည်းပြီးရော ကိုကို့အတွက် ကိုကိုခွါရင်း ဝက်သားက အိုးကပ်ပြီး မည်းသွားတာ အူတက်နေပြီ ပြန်တွေးမိတိုင်း😭 ပြီးတော့ ဒီလ အကုန်နားလေးလောက်မှာလည်း ခြူးနဒီဇော်မွေးနေ့ အတူသွားကြပြီး Monopoly ကို ရေလည် အနိုင်ကျင့်ခဲ့ကြတာ😎❤️",
  },

  // ----------------------------------------------------------------------------
  // MEMORY 8: The Seventh Date: JS
  // ----------------------------------------------------------------------------
  {
    id: 8,
    title: "Our Seventh Date: Junction Square",
    date: "June 2025",
   
    location: [16.8199285, 96.1304261], 
    
    images: [
      "/photos/date-7-1.png", 
      "/photos/date-7-2.png", 
      "/photos/date-7-3.png"
    ],

    description: "ခုနှစ်ခုမြောက် date လေးအတွက် ကိုကိုတို့ 25 ရက်နေ့မှာမသွားဘဲ 14 ရက်နေ့မှာသွားခဲ့ကြတယ်😁 Junction Square မှာ ပန်းအိုးလေးလည်း အတူခြယ်ခဲ့ကြတယ်၊ Photobooth လည်း ရိုက်ခဲ့တယ် 🥰 ပြီးတော့့့့့ malaxiang guo လည်း တူတူစားခဲ့ကြတယ်😋❤️ ပန်းအိုးလေးတွေဆေးခြယ်နေကြတာတောင် video ရှိသေးတယ်ရော၊ နှစ်ယောက်သား မျက်မှောင်ကြီးကြုံ့ပြီးလုပ်နေကြတာ ပြန်ကြည့်တိုင်းအူတက်တာ😭",
  },

// ----------------------------------------------------------------------------
  // MEMORY 9: The Eighth Date
  // ----------------------------------------------------------------------------
  {
    id: 9,
    title: "Our Eighth Date: The Brew, Times City, Movies, KanDawGyi Park!", 
    date: "July 2025",
    location: [16.7973890, 96.1310212], // Don't forget to update the coordinates!
    
    // 👇 HERE ARE YOUR 5 PHOTOS
    images: [
      "/photos/date-8-1.png", 
      "/photos/date-8-2.png", 
      "/photos/date-8-3.png",
      "/photos/date-8-4.png", // Added
      "/photos/date-8-5.png"  // Added
    ],

    description: "ကိုကို Singapore မလာခင် နှစ်ယောက် အတူ သေချာနောက်ဆုံး date ခဲ့ရတဲ့နေ့လေးနော်😞 နေရာတွေအများကြီးသွားပြီး အစုံလုပ်ခဲ့ရတာပဲဗျာ၊ The Brew ကို စတွဲကတည်းက သွားတာ ၇ လကြာပြီးမှ တူတူပြန်သွားတာရော🥺 ပြီးတော့ မျှားပစ်ကြတာရော၊ ဇာတ်ကားအတူကြည့်တာရော (အဲ့နေ့က ရုံမှာ လူရှုပ်နေလို့ နမ်းပဲနမ်းလိုက်ရတယ်😭😭 နိုးးးးးး)၊ ပြီးတော့ အပြန် ကန်တော်ကြီး ကရဝိတ်သင်္ဘောကြီးရှိတဲ့ဘက်သွားကြပြီး ဆိုင်လေးမှာ အအေးအတူသောက်ကြ အလွမ်းသယ်ကြ ဓာတ်ပုံရိုက်ကြပြီးတော့ ပြန်ခဲ့ကြတယ်😞❤️ ရေးရင်းနဲ့တောင် ပြန်သွားချင်သွားပြီဗျာ",
  },

  // ----------------------------------------------------------------------------
  // MEMORY 10: THE FINALE - NUS (KEVII Hall)
  // ----------------------------------------------------------------------------
  {
    id: 10,
    title: "မီနောင်း KEVII Hall - NUS",
    date: "Dec 2025",
    // 📍 REAL COORDINATES FOR KING EDWARD VII HALL, NUS
    location: [1.2924710, 103.7811081], 
    
    images: [
      "/photos/nus-1.png", // Your dorm room?
      "/photos/nus-2.png", // The view outside?
      "/photos/nus-3.png"  // A selfie of you coding this?
    ],

    description: "လောလောဆယ်တော့ ဒီ Anniversary Gift လေး ပြင်ပြီး သဲသဲရဲ့ personal coder ဘွိုင်းဖရန့် (husband) ဖြစ်နေပါတယ်🙂‍↕️ ကိုကိုအခုလို ပြင်ထားတာလေးတွေ ကြိုက်လား မှူးလေး😁 ပစ္စည်းမဟုတ်တဲ့ လက်ဆောင်ဆိုတာ ဒါလေးကိုပြောတာနော်😙 နှစ်ယောက်လုံးကလည်း coder တွေပဲဆိုတော့ သဲသဲ ဒီလိုလေးကြိုက်မယ်ထင်လို့ပါ😛❤️ Happy Anniversary ပါနော် သဲလေးရေ🎉🎉🎉🥳❤️❤️❤️❤️ အသက်ထက်ဆုံးတိုင်အောင် နှစ်ရာနဲ့ချီပြီး အတူချစ်ချစ်ခင်ခင်လက်တွဲသွားကြမယ်နော်😙😙😙😙😙",
  },
];